package module_19_HTTP._19_4_lecture_http_status;

import java.util.ArrayList;
import java.util.LinkedList;
import java.util.Scanner;

public class HttpStatus {
    public HttpStatus() {
        /*
        Основные HTTP Статус-коды - ниже приведены коды которые не обходимо знать

        - 200 OK: Запрос успешно выполнен, и сервер возвращает запрашиваемые данные.
        - 404 Not Found: Запрашиваемый ресурс не найден на сервере.
        - 500 Internal Server Error: Произошла внутренняя ошибка сервера, которая
        мешает выполнить запрос.
        - 400 Bad Request: Сервер не может обработать запрос из-за некорректного
        синтаксиса или недопустимых параметров.
        - 401 Unauthorized: Для доступа к запрашиваемому ресурсу требуется
        аутентификация. Клиент должен предоставить правильные учетные данные.
        - 403 Forbidden: У клиента отсутствуют права доступа к запрашиваемому
        ресурсу, даже после аутентификации.
        - 302 Found: Ресурс временно перемещен по другому URL-адресу. Клиент
        должен перенаправить запрос на новый URL.
         */

        /*
        Форматы кодов:
        1xx - Informational
        2xx - Success
        3xx - Redirection
        4xx - Client Error
        5xx - Server Error
         */
    }
}
